{
  "name": "Aaryan Patel",
  "email": "a52patel@uwaterloo.ca",
  "headerTaglineOne": [
    "Computer Science Student",
    "Life-Long Learner",
    "Software Engineer",
    "Algorithm Solver",
    "Soccer Fanatic",
    "Cloud Computing Advocate",
    "AI/ML Enthusiast",
    "Spider-Man Fan",
    "Microservices Explorer",
    "Mario Kart Tryhard"
  ],
  "darkMode": true,
  "socials": {
    "linkedin": "https://www.linkedin.com/in/aaryan-patel-896179217/",
    "github": "https://github.com/patel-aaryan",
    "devpost": "https://devpost.com/patel-aaryan?ref_content=user-portfolio&ref_feature=portfolio&ref_medium=global-nav",
    "instagram": "https://www.instagram.com/aaryan.pat3l/",
    "email": "mailto:a52patel@uwaterloo.ca"
  },
  "aboutMe": "I build systems that scale. Fluent in C++, Python, and JavaScript, I'm fascinated by distributed architectures, high-performance computing, and AI systems. From optimizing memory management and concurrent processing to designing fault-tolerant distributed systems and training models at scale, I live for the challenge of making complex systems run faster and more reliably. I thrive on solving problems that better the lives of others.",
  "skills": {
    "languages": [
      "C++",
      "Python",
      "SQL",
      "C#",
      "TypeScript",
      "Java",
      "HTML",
      "CSS"
    ],
    "frontend": [
      "React",
      "Angular",
      "Next.js",
      "Tailwind CSS",
      "Vitest",
      "Figma",
      "Redux",
      "jQuery"
    ],
    "backend": [
      "ASP.NET",
      "Django",
      "Node.js",
      "Nest.js",
      "MySQL",
      "PostgreSQL",
      "Fastify",
      "MongoDB"
    ],
    "devops": [
      "Git",
      "Docker",
      "Kubernetes",
      "Terraform",
      "Google Cloud Platform",
      "CircleCI",
      "AWS",
      "Jenkins"
    ]
  },
  "education": [
    {
      "name": "University of Waterloo",
      "date": "2022 - 2027",
      "major": "Computer Science & Artificial Intelligence",
      "minor": "Minor in Economics",
      "location": "Waterloo, ON, Canada",
      "colour": "#EAAB00",
      "courses": [
        {
          "code": "CS 135",
          "name": "Designing Functional Programs",
          "desc": [
            "Introduction to the fundamentals of computer science through functional programming, emphasizing elementary programming patterns",
            "Exploration of syntax, semantics, and tracing program execution using substitution methods",
            "Coverage of software development practices, including design, testing, and documentation",
            "Study of both linear and nonlinear data structures, with a focus on recursive data definitions",
            "Examination of key principles like abstraction and encapsulation",
            "Analysis of different types of recursion, specifically generative and structural",
            "Contextualization within the historical evolution of functional programming"
          ],
          "link": "https://uwflow.com/course/cs135"
        },
        {
          "code": "CS 136",
          "name": "Elementary Algorithm Design and Data Abstraction",
          "desc": [
            "Builds on techniques and patterns from CS 135, transitioning to imperative programming",
            "Introduces design and analysis of algorithms, information management, and implementation techniques",
            "Covers iterative and recursive sorting algorithms",
            "Discusses data structures like lists, stacks, queues, and trees",
            "Focuses on abstract data types and their implementations"
          ],
          "link": "https://uwflow.com/course/cs136"
        },
        {
          "code": "CS 246E",
          "name": "Object-Oriented Software Development (Enriched)",
          "desc": [
            "Enriched introduction to object-oriented programming and tools for software development",
            "Covers designing, coding, debugging, testing, and documenting medium-sized programs",
            "Focuses on reading specifications and designing software to implement them",
            "Involves selecting appropriate data structures and control structures",
            "Emphasizes writing reusable code and reusing existing code",
            "Introduces basic performance issues, debuggers, and test suites"
          ],
          "link": "https://uwflow.com/course/cs246e"
        },
        {
          "code": "CS 240",
          "name": "Data Structures and Data Management",
          "desc": [
            "Introduction to widely used and effective methods of data organization",
            "Focuses on data structures, their algorithms, and algorithm performance",
            "Covers specific topics like priority queues, sorting, dictionaries, and data structures for text processing"
          ],
          "link": "https://uwflow.com/course/cs240"
        },
        {
          "code": "CS 241",
          "name": "Foundations of Sequential Programs (Compilers)",
          "desc": [
            "Explores the relationship between high-level languages and the underlying computer architecture",
            "Covers basic machine architecture and assemblers",
            "Includes specification and translation of programming languages",
            "Discusses linkers, loaders, and block-structured languages",
            "Examines parameter passing mechanisms and comparison of programming languages"
          ],
          "link": "https://uwflow.com/course/cs241"
        },
        {
          "code": "CS 251",
          "name": "Computer Organization and Design",
          "desc": [
            "Overview of computer organization and performance",
            "Covers basics of digital logic design",
            "Discusses combinational and sequential elements",
            "Explores data representation and manipulation",
            "Introduces basics of processor design and pipelining",
            "Examines memory hierarchies and multiprocessors"
          ],
          "link": "https://uwflow.com/course/cs251"
        }
      ],
      "clubs": [
        {
          "title": "HackTheNorth",
          "role": "Volunteer"
        },
        {
          "title": "Data Science Club",
          "role": "Developer"
        },
        {
          "title": "WATOnomous",
          "role": "Atonomous Software Division"
        }
      ],
      "milestones": [
        "Math National Scholarship",
        "President’s Scholarship Of Distinction"
      ]
    },
    {
      "name": "St. Francis Xavier Secondary School",
      "date": "2018 - 2022",
      "major": "International Baccalaureate",
      "location": "Mississauga, ON, Canada",
      "colour": "#005DAA",
      "clubs": [
        {
          "title": "STEM Club",
          "role": "Co-founder"
        },
        {
          "title": "Computer Science Club",
          "role": "Member"
        },
        {
          "title": "Math Club",
          "role": "Member"
        },
        {
          "title": "French Club",
          "role": "Member"
        }
      ],
      "milestones": [
        "Canadian Computing Competition - Certificate of Distinction",
        "Euclid Contest - Certificate of Distinction",
        "Canadian Senior Mathematics Contest - Certificate of Distinction"
      ]
    }
  ],
  "experience": [
    {
      "title": "Backend/API Developer",
      "company": "Scrawlr",
      "location": "Vancouver, BC, Canada",
      "description": [
        "Contributed to scalable backend APIs for browser-extension platform, using Node.js + Fastify with Postgres and Redis to layer real-time conversation and personalized content onto any webpage",
        "Standardized codebase by authoring reusable Cursor rule packs that enforce layered architecture, uniform error handling, and code consistency, enabling faster, conflict-free feature rollouts across teams",
        "Architected an AI-driven code-gen pipeline that ingests product docs & Cursor rules to auto-scaffold Fastify services, database schemas, cache layers, and Vitest tests, cutting API development from months to days"
      ],
      "date": "May. 2025 - Aug. 2025",
      "colour": "#196AFF",
      "icon": ""
    },
    {
      "title": "QTS Software Developer Intern",
      "company": "RBC Capital Markets",
      "location": "Toronto, ON, Canada",
      "description": [
        "Developed full-stack trading analytics platform using React, Next.js, Kuberentes, and MongoDB, leveraging AI-driven trade reports enhance market predictions and decision-making for traders",
        "Utilized Redux for state management and React Query for API integration and caching, reducing API call latency by 40% and ensuring real-time updates for datasets exceeding 20K rows",
        "Introduced interactive Liquidity Matrix feature to analyzes & visualizes FX market liquidity across 24 trading hours, providing actionable insights with an interactive and concise interface to improve trading decisions",
        "Leveraged Highcharts, AG Grid, and React Virtualized to improve index analytics performance by 35% with dynamic visualizations & auto-complete filtering, delivering a seamless user experience"
      ],
      "date": "Sep. 2024 - Dec. 2024",
      "colour": "#005DAA",
      "icon": ""
    },
    {
      "title": "Application Developer",
      "company": "CGI Inc",
      "location": "Toronto, ON, Canada",
      "description": [
        "Specialized in building and managing cloud-based API ecosystems using Google Cloud Platform as well as deploying, monitoring, and managing enterprise solutions on the cloud",
        "Designed and deployed a PostgreSQL database integrated with Keycloak, streamlining authentication process",
        "Leveraged Terraform to automate infrastructure provisioning, which optimized deployment time by up to 70%, significant enhancing operational efficiency"
      ],
      "date": "Jan. 2024 - May 2024",
      "colour": "#E31937",
      "icon": ""
    },
    {
      "title": "Junior Software Developer",
      "company": "JANA Corporation",
      "location": "Aurora, ON, Canada",
      "description": [
        "Developed backend solutions using C#, ASP.NET, and SQL Server, contributing to the architecture, implementation, and maintenance of pipeline integrity management application",
        "Led the optimization of SQL queries, significantly enhancing the performance of the data management REST API, which improved dynamic data retrieval and display",
        "Introduced new visualization feature that displayed risk level results for predictive risk analysis, aiding in better decision-making for pipeline integrity management",
        "Lead migration of APIs to a high-performance serialization library, boosting API performance by up to 50%"
      ],
      "date": "May 2023 - Aug. 2023",
      "colour": "#6EB273",
      "icon": ""
    },
    {
      "title": "Junior Developer",
      "company": "CGI Inc",
      "location": "Mississauga, ON, Canada",
      "description": [
        "Development using Angular, TypeScript, HTML & CSS, improving overall application functionality",
        "Lead the redesigning of a POS inventory application to better meet the specific needs of a telecom client, enhancing user satisfaction and operational efficiency",
        "Improved inventory management functionalities using RESTful APIs, resulting in a more intuitive user experience"
      ],
      "date": "Jun. 2022 - Sep. 2022",
      "colour": "#E31937",
      "icon": ""
    }
  ],
  "projects": [
    {
      "title": "G.R.A.C.E. (Coming Soon)",
      "description": "An AI-powered social companion that engages isolated users through lifelike face-to-face conversations with real-time voice-to-avatar interactions. Features lip-synced 3D avatars and a comprehensive caregiver dashboard with conversation analytics.",
      "tech": ["Next.js", "FastAPI", "Pipecat", "Deepgram"],
      "colour": "#7952B3",
      "link": "",
      "source": "https://github.com/patel-aaryan/GRACE"
    },
    {
      "title": "AniTrack",
      "description": "Full-stack anime tracking application that allows users to discover popular anime, write reviews, add new titles, find friends with shared interests, and manage their watch history. Features comprehensive database management and community-driven content.",
      "tech": ["Next.js", "TypeScript", "PostgreSQL", "Python"],
      "colour": "#FFC107",
      "link": "https://ani-track-zeta.vercel.app",
      "source": "https://github.com/patel-aaryan/AniTrack"
    },
    {
      "title": "STYLit",
      "description": "Virtually try on clothing in real time using AI-powered image segmentation and pose estimation, allowing users to visualize how clothes fit and personalize outfits before purchasing online",
      "tech": ["Next.js", "Express.js", "MongoDB", "MediaPipe"],
      "colour": "#FF616D",
      "link": "",
      "source": "https://github.com/patel-aaryan/STYLit"
    },
    {
      "title": "CraftsByAash",
      "description": "E-commerce platform showcasing Lippan Art Decor and allows users to register, explore products, and complete orders securely",
      "tech": ["Django", "Next.js", "MySQL", "Stripe", "Docker"],
      "colour": "#96BD4A",
      "link": "https://www.craftsbyaash.com/",
      "source": "https://github.com/patel-aaryan/CraftsByAash"
    },
    {
      "title": "P.E.P.P.E.R.",
      "description": "A compassionate chatbot that delivers human-like responses, designed to alleviate loneliness among elderly individuals and patients experiencing social isolation",
      "tech": ["Next.js", "Tailwind CSS", "Python"],
      "colour": "#7952B3",
      "link": "https://pepper-phi.vercel.app/",
      "source": "https://github.com/patel-aaryan/PEPPER"
    },
    {
      "title": "Spotisize",
      "description": "Web app that creatively visualizes users' Spotify data by categorizing and displaying their listening activity",
      "tech": ["Next.js", "Tailwind CSS", "Spotify API"],
      "colour": "#FF616D",
      "link": "https://spotisize.vercel.app/",
      "source": "https://github.com/patel-aaryan/SpotiSize"
    },
    {
      "title": "NoiseRebel",
      "description": "Automated soundboard for Discord servers and plays dynamics sounds in voice chat using event-based Discord APIs",
      "tech": ["JavaScript", "Discord API"],
      "colour": "#185ADB",
      "link": "",
      "source": "https://github.com/patel-aaryan/NoiseRebel"
    },
    {
      "title": "Ambulert",
      "description": "Mobile app that notifies civilians of a nearby ambulance during emergencies, using the real-time locations of the civilian and the ambulance to enhance awareness and improve safety",
      "tech": ["Flutter", "Dart", "Flask", "Python"],
      "colour": "#1597BB",
      "link": "",
      "source": "https://github.com/patel-aaryan/Ambulert"
    },
    {
      "title": "Foodar",
      "description": "Recommendation system that provides the top 3 restaurant recommendations based on location, helping university students make informed dietary choices",
      "tech": ["Angular", "Python", "NumPy", "Pandas"],
      "colour": "#F54748",
      "link": "",
      "source": "https://github.com/patel-aaryan/Foodar"
    }
  ]
}
