{
  "name": "Aaryan Patel",
  "email": "a52patel@uwaterloo.ca",
  "headerTaglineOne": [
    "Computer Science Student",
    "Life-Long Learner",
    "Software Engineer",
    "Algorithm Solver",
    "Soccer Fanatic",
    "Cloud Computing Advocate",
    "AI/ML Enthusiast",
    "Spider-Man Fan",
    "Microservices Explorer",
    "Mario Kart Tryhard"
  ],
  "socials": {
    "linkedin": "https://www.linkedin.com/in/aaryan-patel-896179217/",
    "github": "https://github.com/patel-aaryan",
    "instagram": "https://www.instagram.com/aaryan.pat3l/",
    "email": "mailto:a52patel@uwaterloo.ca"
  },
  "aboutMe": "I build systems that scale. Fluent in C++, Python, and JavaScript, I'm fascinated by distributed architectures, high-performance computing, and AI systems. From optimizing memory management and concurrent processing to designing fault-tolerant distributed systems and training models at scale, I live for the challenge of making complex systems run faster and more reliably. I thrive on solving problems that better the lives of others.",
  "skills": {
    "languages": [
      "C++",
      "Python",
      "SQL",
      "C#",
      "TypeScript",
      "Java",
      "HTML",
      "CSS"
    ],
    "frontend": [
      "React",
      "Angular",
      "Next.js",
      "Tailwind CSS",
      "Vitest",
      "Figma",
      "Redux",
      "jQuery"
    ],
    "backend": [
      "ASP.NET",
      "Django",
      "Node.js",
      "Nest.js",
      "MySQL",
      "PostgreSQL",
      "Fastify",
      "MongoDB"
    ],
    "devops": [
      "Git",
      "Docker",
      "Kubernetes",
      "Terraform",
      "Google Cloud",
      "CircleCI",
      "AWS",
      "Jenkins"
    ]
  },
  "education": [
    {
      "name": "University of Waterloo",
      "date": "Sep. 2022 - June 2027",
      "major": "Computer Science & Artificial Intelligence",
      "minor": "Minor in Economics",
      "location": "Waterloo, ON, Canada",
      "colour": "#EAAB00",
      "courses": [
        {
          "code": "CS 350",
          "name": "Operating Systems",
          "desc": [
            "Process and Thread Management - Understanding processes, threads, system calls, context switching, and different types of scheduling algorithms for managing processor time",
            "Concurrency and Synchronization - Principles of concurrency, mutual exclusion, semaphores, deadlock detection and prevention mechanisms",
            "Memory Management Systems - Virtual addressing, address translation, memory management techniques including partitioning, segmentation, paging, and caching strategies",
            "Device and File System Management - Physical device properties, device control, buffering, disk scheduling, file naming, space allocation, and file system implementation strategies",
            "Interprocess Communication - Message passing, pipes, sockets, signals, shared memory, and other communication mechanisms between processes"
          ],
          "link": "https://uwflow.com/course/cs350"
        },
        {
          "code": "CS 341",
          "name": "Algorithms",
          "desc": [
            "Algorithm Design Techniques - Systematic study of design methods including greedy algorithms, dynamic programming, graph exploration approaches, backtracking, and branch and bound techniques",
            "Algorithm Analysis - Review of divide and conquer approaches, solution of recurrence relations, and analysis of average case and worst case behaviors",
            "Undecidability and Complexity Theory - Introduction to algorithmic reductions, undecidability of the halting problem, polynomial time complexity, and the relationship between P and NP classes",
            "NP-Completeness - Study of polynomial reducibility, NP-Complete problems, and proofs of NP-hardness for various computational problems",
            "Practical Problem Solving - Application of algorithmic techniques to commonly occurring problems in practice with implementation experience and related programming challenges"
          ],
          "link": "https://uwflow.com/course/cs341"
        },
        {
          "code": "CS 348",
          "name": "Introduction to Database Management",
          "desc": [
            "Relational Data Model and Languages - Fundamentals of relational databases, relational calculus and algebra, SQL DDL/DML, and database query languages including Query by Example (QBE)",
            "Database Design Methodology - Logical data modeling using Entity-Relationship modeling, mapping ER models to relational models, and normalization to Boyce-Codd Normal Form",
            "Database Application Development - Embedded SQL programming, transaction concepts, access granularity principles, and interfaces like ODBC and JDBC",
            "Database Administration and Optimization - Database indexing for performance tuning, views and view management, database security and authorization mechanisms",
            "Advanced Database Topics - Introduction to distributed databases, data warehouses, and data mining concepts",
            "Database System Architecture - Understanding the architecture and internal workings of database management systems and their core components"
          ],
          "link": "https://uwflow.com/course/cs348"
        },
        {
          "code": "CS 370",
          "name": "Numerical Computation",
          "desc": [
            "Floating Point Number Systems - Understanding floating point representation, round-off error propagation, machine precision concepts, and stability analysis of numerical recursions",
            "Interpolation and Approximation - Polynomial interpolation using Vandermonde matrix and Lagrange methods, cubic splines, B-splines, and applications like scalable fonts",
            "Ordinary Differential Equations - Numerical methods including forward/backward Euler, modified Euler methods, local truncation error analysis, stability, and global error with applications to pursuit problems and disease propagation models",
            "Discrete Fourier Analysis - Fourier series, Fast Fourier Transform (FFT) algorithms including the butterfly method, with applications to JPEG compression, image processing, and signal processing",
            "Numerical Linear Algebra - LU decomposition, pivoting techniques, condition number analysis, QR decomposition, and large-scale applications like Google's PageRank algorithm",
            "Scientific Computing Applications - Practical implementation using MATLAB, vectorization techniques, and real-world examples from engineering, graphics, and financial computing"
          ],
          "link": "https://uwflow.com/course/cs370"
        },
        {
          "code": "CS 246E",
          "name": "Object-Oriented Software Development (Enriched)",
          "desc": [
            "Enriched introduction to object-oriented programming and tools for software development",
            "Covers designing, coding, debugging, testing, and documenting medium-sized programs",
            "Focuses on reading specifications and designing software to implement them",
            "Involves selecting appropriate data structures and control structures",
            "Emphasizes writing reusable code and reusing existing code",
            "Introduces basic performance issues, debuggers, and test suites"
          ],
          "link": "https://uwflow.com/course/cs246e"
        },
        {
          "code": "CS 251",
          "name": "Computer Organization and Design",
          "desc": [
            "Overview of computer organization and performance",
            "Covers basics of digital logic design",
            "Discusses combinational and sequential elements",
            "Explores data representation and manipulation",
            "Introduces basics of processor design and pipelining",
            "Examines memory hierarchies and multiprocessors"
          ],
          "link": "https://uwflow.com/course/cs251"
        },
        {
          "code": "CS 241",
          "name": "Foundations of Sequential Programs (Compilers)",
          "desc": [
            "Explores the relationship between high-level languages and the underlying computer architecture",
            "Covers basic machine architecture and assemblers",
            "Includes specification and translation of programming languages",
            "Discusses linkers, loaders, and block-structured languages",
            "Examines parameter passing mechanisms and comparison of programming languages"
          ],
          "link": "https://uwflow.com/course/cs241"
        },
        {
          "code": "CS 240",
          "name": "Data Structures and Data Management",
          "desc": [
            "Introduction to widely used and effective methods of data organization",
            "Focuses on data structures, their algorithms, and algorithm performance",
            "Covers specific topics like priority queues, sorting, dictionaries, and data structures for text processing"
          ],
          "link": "https://uwflow.com/course/cs240"
        },
        {
          "code": "CS 136",
          "name": "Elementary Algorithm Design and Data Abstraction",
          "desc": [
            "Builds on techniques and patterns from CS 135, transitioning to imperative programming",
            "Introduces design and analysis of algorithms, information management, and implementation techniques",
            "Covers iterative and recursive sorting algorithms",
            "Discusses data structures like lists, stacks, queues, and trees",
            "Focuses on abstract data types and their implementations"
          ],
          "link": "https://uwflow.com/course/cs136"
        },
        {
          "code": "CS 135",
          "name": "Designing Functional Programs",
          "desc": [
            "Introduction to the fundamentals of computer science through functional programming, emphasizing elementary programming patterns",
            "Exploration of syntax, semantics, and tracing program execution using substitution methods",
            "Coverage of software development practices, including design, testing, and documentation",
            "Study of both linear and nonlinear data structures, with a focus on recursive data definitions",
            "Examination of key principles like abstraction and encapsulation",
            "Analysis of different types of recursion, specifically generative and structural",
            "Contextualization within the historical evolution of functional programming"
          ],
          "link": "https://uwflow.com/course/cs135"
        }
      ],
      "clubs": [
        {
          "title": "Data Science Club",
          "role": "VP Development",
          "date": "Sep. 2025 - Present",
          "desc": [
            "Developed QR code check-in system and admin portal for seamless event management and member tracking",
            "Built public calendar interface to visualize past and upcoming events with responsive frontend design",
            "Led the development of the custom exec application portal to streamline future applicant recruitment and evaluation processes",
            "Spearheaded the overhaul of the server architecture into clean, organized layers to improve code readability for new developers",
            "Enhanced frontend responsiveness and established consistent design theme to reduce onboarding time for new members"
          ]
        },
        {
          "title": "Raas Warriors",
          "role": "Dancer",
          "date": "Sep. 2024 - Mar. 2025"
        },
        {
          "title": "HackTheNorth",
          "role": "Volunteer",
          "date": "Sep. 2024"
        },
        {
          "title": "WATOnomous",
          "role": "Autonomous Software Division",
          "date": "May 2024 - Aug. 2024",
          "desc": [
            "Learned ROS pub-sub architecture and messaging patterns for autonomous vehicle software communication",
            "Gained exposure to multi-modal sensor data streams from LiDAR, cameras, radar, and GPS through ROS topics",
            "Explored distributed system concepts for scalable autonomous driving software using decentralized ROS nodes",
            "Studied robotics software patterns for real-world autonomous vehicle challenges and V2V/V2I communications"
          ]
        }
      ],
      "milestones": [
        "Mathematics National Scholarship",
        "President's Scholarship Of Distinction"
      ]
    }
  ],
  "experience": [
    {
      "title": "Backend/API Developer",
      "company": "Scrawlr",
      "location": "Vancouver, BC, Canada",
      "description": [
        "Contributed to scalable backend APIs for browser-extension platform, using Node.js + Fastify with Postgres and Redis to layer real-time conversation and personalized content onto any webpage",
        "Standardized codebase by authoring reusable Cursor rule packs that enforce layered architecture, uniform error handling, and code consistency, enabling faster, conflict-free feature rollouts across teams",
        "Architected an AI-driven code-gen pipeline that ingests product docs & Cursor rules to auto-scaffold Fastify services, database schemas, cache layers, and Vitest tests, cutting API development from months to days"
      ],
      "date": "May. 2025 - Aug. 2025",
      "colour": "#196AFF",
      "icon": "",
      "tech": ["Node.js", "Fastify", "PostgreSQL", "Redis", "Docker"]
    },
    {
      "title": "Software Engineer Intern",
      "company": "RBC Capital Markets",
      "location": "Toronto, ON, Canada",
      "description": [
        "Developed full-stack trading analytics platform using React, Next.js, Kubernetes, and MongoDB, leveraging AI-driven trade reports enhance market predictions and decision-making for traders",
        "Utilized Redux for state management and React Query for API integration and caching, reducing API call latency by 40% and ensuring real-time updates for datasets exceeding 20K rows",
        "Introduced interactive Liquidity Matrix feature to analyzes & visualizes FX market liquidity across 24 trading hours, providing actionable insights with an interactive and concise interface to improve trading decisions",
        "Leveraged Highcharts, AG Grid, and React Virtualized to improve index analytics performance by 35% with dynamic visualizations & auto-complete filtering, delivering a seamless user experience"
      ],
      "date": "Sep. 2024 - Dec. 2024",
      "colour": "#005DAA",
      "icon": "",
      "tech": ["Next.js", "Kubernetes", "MongoDB", "Redux"]
    },
    {
      "title": "Application Developer",
      "company": "CGI Inc",
      "location": "Toronto, ON, Canada",
      "description": [
        "Specialized in building and managing cloud-based API ecosystems using Google Cloud as well as deploying, monitoring, and managing enterprise solutions on the cloud",
        "Designed and deployed a PostgreSQL database integrated with Keycloak, streamlining authentication process",
        "Leveraged Terraform to automate infrastructure provisioning, which optimized deployment time by up to 70%, significant enhancing operational efficiency"
      ],
      "date": "Jan. 2024 - May 2024",
      "colour": "#E31937",
      "icon": "",
      "tech": ["Google Cloud", "PostgreSQL", "Keycloak", "Terraform"]
    },
    {
      "title": "Junior Software Developer",
      "company": "JANA Corporation",
      "location": "Aurora, ON, Canada",
      "description": [
        "Developed backend solutions using C#, ASP.NET, and SQL Server, contributing to the architecture, implementation, and maintenance of pipeline integrity management application",
        "Led the optimization of SQL queries, significantly enhancing the performance of the data management REST API, which improved dynamic data retrieval and display",
        "Introduced new visualization feature that displayed risk level results for predictive risk analysis, aiding in better decision-making for pipeline integrity management",
        "Lead migration of APIs to a high-performance serialization library, boosting API performance by up to 50%"
      ],
      "date": "May 2023 - Aug. 2023",
      "colour": "#6EB273",
      "icon": "",
      "tech": ["C#", "ASP.NET", "SQL Server"]
    },
    {
      "title": "Junior Developer",
      "company": "CGI Inc",
      "location": "Mississauga, ON, Canada",
      "description": [
        "Development using Angular, TypeScript, HTML & CSS, improving overall application functionality",
        "Lead the redesigning of a POS inventory application to better meet the specific needs of a telecom client, enhancing user satisfaction and operational efficiency",
        "Improved inventory management functionalities using RESTful APIs, resulting in a more intuitive user experience"
      ],
      "date": "Jun. 2022 - Sep. 2022",
      "colour": "#E31937",
      "icon": "",
      "tech": ["Angular", "TypeScript", "HTML", "CSS"]
    }
  ],
  "featuredProjects": [
    {
      "title": "G.R.A.C.E.",
      "description": "An AI-powered social companion that engages isolated users through lifelike face-to-face conversations with real-time voice-to-avatar interactions. Features lip-synced 3D avatars and a comprehensive caregiver dashboard with conversation analytics.",
      "tech": ["Next.js", "FastAPI", "Pipecat", "Deepgram"],
      "colour": "#7952B3",
      "link": "",
      "source": "https://github.com/patel-aaryan/GRACE",
      "features": [
        "Real-time voice-to-avatar conversations",
        "Lip-synced 3D avatars for lifelike interactions",
        "AI-powered social companion functionality",
        "Comprehensive caregiver dashboard",
        "Conversation analytics and insights"
      ],
      "thumbnail": ""
    },
    {
      "title": "AniTrack",
      "description": "Full-stack anime tracking application that allows users to discover popular anime, write reviews, add new titles, find friends with shared interests, and manage their watch history. Features comprehensive database management and community-driven content.",
      "tech": ["Next.js", "TypeScript", "PostgreSQL", "Python"],
      "colour": "#FFC107",
      "link": "https://ani-track-zeta.vercel.app",
      "source": "https://github.com/patel-aaryan/AniTrack",
      "features": [
        "Discover trending and popular anime",
        "Write and share anime reviews",
        "Add new anime titles to the database",
        "Find friends with similar anime interests",
        "Track personal watch history and progress"
      ],
      "thumbnail": ""
    },
    {
      "title": "STYLit",
      "description": "Virtually try on clothing in real time using AI-powered image segmentation and pose estimation, allowing users to visualize how clothes fit and personalize outfits before purchasing online",
      "tech": ["Next.js", "Express.js", "MongoDB", "MediaPipe"],
      "colour": "#FF616D",
      "link": "",
      "source": "https://github.com/patel-aaryan/STYLit",
      "features": [
        "Real-time virtual clothing try-on",
        "AI-powered image segmentation",
        "Pose estimation technology",
        "Personalized outfit visualization",
        "Pre-purchase clothing fitting simulation"
      ],
      "thumbnail": ""
    }
  ],
  "projects": [
    {
      "title": "G.R.A.C.E. (Coming Soon)",
      "description": "An AI-powered social companion that engages isolated users through lifelike face-to-face conversations with real-time voice-to-avatar interactions. Features lip-synced 3D avatars and a comprehensive caregiver dashboard with conversation analytics.",
      "tech": {
        "Frontend": [
          "Next.js",
          "TypeScript",
          "Tailwind CSS",
          "Shadcn",
          "Redux"
        ],
        "Backend": ["FastAPI", "Python", "Supabase", "Redis", "PostgreSQL"],
        "AI/ML & Data Science": ["Pipecat", "Deepgram", "Cartesia", "Gemini"]
      },
      "mainTech": ["FastAPI", "Deepgram", "Cartesia"],
      "colour": "#7952B3",
      "link": "",
      "source": "https://github.com/patel-aaryan/GRACE",
      "features": [
        "Real-time voice-to-avatar conversations",
        "Lip-synced 3D avatars for lifelike interactions",
        "AI-powered social companion functionality",
        "Comprehensive caregiver dashboard",
        "Conversation analytics and insights"
      ],
      "thumbnail": ""
    },
    {
      "title": "AniTrack",
      "description": "Full-stack anime tracking application that allows users to discover popular anime, write reviews, add new titles, find friends with shared interests, and manage their watch history. Features comprehensive database management and community-driven content.",
      "tech": {
        "Frontend ": ["Next.js", "TypeScript", "Tailwind CSS"],
        "Backend ": ["Node.js", "Python", "PostgreSQL"],
        "Developer Tools": ["Prisma", "NextAuth.js"]
      },
      "mainTech": ["Node.js", "PostgreSQL", "Python"],
      "colour": "#FFC107",
      "link": "https://ani-track-zeta.vercel.app",
      "source": "https://github.com/patel-aaryan/AniTrack",
      "features": [
        "Discover trending and popular anime",
        "Write and share anime reviews",
        "Add new anime titles to the database",
        "Find friends with similar anime interests",
        "Track personal watch history and progress"
      ],
      "thumbnail": ""
    },
    {
      "title": "STYLit",
      "description": "Virtually try on clothing in real time using AI-powered image segmentation and pose estimation, allowing users to visualize how clothes fit and personalize outfits before purchasing online",
      "tech": {
        "Frontend ": ["Next.js", "TypeScript", "Tailwind CSS", "Shadcn"],
        "Backend ": ["Express.js", "Node.js", "MongoDB"],
        "AI/ML & Data Science": ["MediaPipe"]
      },
      "mainTech": ["Node.js", "MediaPipe", "MongoDB"],
      "colour": "#FF616D",
      "link": "",
      "source": "https://github.com/patel-aaryan/STYLit",
      "features": [
        "Real-time virtual clothing try-on",
        "AI-powered image segmentation",
        "Pose estimation technology",
        "Personalized outfit visualization",
        "Pre-purchase clothing fitting simulation"
      ],
      "thumbnail": ""
    },
    {
      "title": "CraftsByAash",
      "description": "E-commerce platform showcasing Lippan Art Decor and allows users to register, explore products, and complete orders securely",
      "tech": {
        "Frontend": ["Next.js", "TypeScript", "Redux", "MUI"],
        "Backend": ["Django", "Python", "Django REST Framework", "MySQL"],
        "Devops & Integration": ["Docker", "AWS S3", "Stripe"]
      },
      "mainTech": ["Django", "Next.js", "Stripe"],
      "colour": "#96BD4A",
      "link": "https://www.craftsbyaash.com/",
      "source": "https://github.com/patel-aaryan/CraftsByAash",
      "features": [
        "User registration and authentication",
        "Product catalog with Lippan Art Decor",
        "Secure payment processing with Stripe",
        "Order management system",
        "Responsive e-commerce interface"
      ],
      "thumbnail": ""
    },
    {
      "title": "P.E.P.P.E.R.",
      "description": "A compassionate chatbot that delivers human-like responses, designed to alleviate loneliness among elderly individuals and patients experiencing social isolation",
      "tech": {
        "Frontend": ["Next.js", "TypeScript", "Tailwind CSS"],
        "Backend & AI/ML": ["OpenAI API", "Google Cloud Functions"]
      },
      "mainTech": ["Next.js", "OpenAI API", "Cloud Functions"],
      "colour": "#7952B3",
      "link": "https://pepper-phi.vercel.app/",
      "source": "https://github.com/patel-aaryan/PEPPER",
      "features": [
        "Human-like conversational responses",
        "Designed for elderly users",
        "Social isolation alleviation features",
        "Compassionate interaction design",
        "Patient-focused interface"
      ],
      "thumbnail": ""
    },
    {
      "title": "Spotisize",
      "description": "Web app that creatively visualizes users' Spotify data by categorizing and displaying their listening activity",
      "tech": {
        "Frontend": ["Next.js", "D3.js"],
        "Backend": ["Node.js"],
        "APIs & Integration": ["Spotify API", "OAuth 2.0"]
      },
      "mainTech": ["Next.js", "Spotify API", "D3.js"],
      "colour": "#FF616D",
      "link": "https://spotisize.vercel.app/",
      "source": "https://github.com/patel-aaryan/SpotiSize",
      "features": [
        "Creative Spotify data visualization",
        "Listening activity categorization",
        "Personal music insights",
        "Interactive data displays",
        "Spotify API integration"
      ],
      "thumbnail": ""
    },
    {
      "title": "NoiseRebel",
      "description": "Automated soundboard for Discord servers and plays dynamics sounds in voice chat using event-based Discord APIs",
      "tech": {
        "Backend": ["JavaScript", "Node.js"],
        "APIs & Integration": ["Discord API"],
        "Developer Tools": ["FFmpeg", "File System API"]
      },
      "mainTech": ["Node.js", "Discord API", "FFmpeg"],
      "colour": "#185ADB",
      "link": "",
      "source": "https://github.com/patel-aaryan/NoiseRebel",
      "features": [
        "Automated Discord soundboard",
        "Dynamic sound playback in voice chat",
        "Event-based Discord API integration",
        "Server-wide sound management",
        "Real-time voice channel interaction"
      ],
      "thumbnail": ""
    },
    {
      "title": "Ambulert",
      "description": "Mobile app that notifies civilians of a nearby ambulance during emergencies, using the real-time locations of the civilian and the ambulance to enhance awareness and improve safety",
      "tech": {
        "Mobile": ["Flutter", "Dart"],
        "Backend": ["Flask", "Python"],
        "Cloud & Messaging": ["Firebase", "Push Notifications"]
      },
      "mainTech": ["Flutter", "Firebase", "Flask"],
      "colour": "#1597BB",
      "link": "",
      "source": "https://github.com/patel-aaryan/Ambulert",
      "features": [
        "Real-time ambulance location tracking",
        "Civilian notification system",
        "Emergency awareness enhancement",
        "Mobile app interface",
        "Safety improvement features"
      ],
      "thumbnail": ""
    },
    {
      "title": "Foodar",
      "description": "Recommendation system that provides the top 3 restaurant recommendations based on location, helping university students make informed dietary choices",
      "tech": {
        "Frontend": ["Angular", "TypeScript", "Bootstrap"],
        "Data Analytics & AI": ["Python", "NumPy", "Pandas"]
      },
      "mainTech": ["Angular", "Python", "Pandas"],
      "colour": "#F54748",
      "link": "",
      "source": "https://github.com/patel-aaryan/Foodar",
      "features": [
        "Location-based restaurant recommendations",
        "Top 3 recommendation system",
        "University student focused",
        "Informed dietary choice support",
        "Data-driven suggestion engine"
      ],
      "thumbnail": ""
    }
  ]
}
